{
  "section1": {
    "question1": {
      "text": "Is there an Ethics Committee that approved your AI project?",
      "description": "Most of the companies have an Ethics Committee with experts in the area: has the project been approved by this commitee? The user must select yes in case it has been approved by the commitee. ",
      "boolean": true
    },
    "question2": {
      "text": "Does your AI project promote well-being, preserve dignity, or sustain the planet?",
      "description": "Sometimes Artificial Intelligence projects can be specifiquely addressed to social causes, enviromental causes, non profit organizations or other good actions. In this case, the answer to this question would be yes.",
      "boolean": true
    },
    "question3": {
      "text": "Does your AI project preserve the personal privacy and the security of the data?",
      "description": "A crucial aspect when it comes to Artificial Intelligence is respecting individual privacy. This is why this aspect must be taken into account when understanding all the actions that must be taken in the project",
      "boolean": true
    },
    "question4": {
      "text": "Does your AI project still give the individuals the right to make decisions for themselves ?",
      "description": "Aritificial Intelligence can sometimes deprive individuals from taking certain decisions. In case the project can compromise decision making for individuals, the answer must be yes.",
      "boolean": true
    },
    "question5": {
      "text": "Does your AI project  promote justice and seek to eliminate discrimination?",
      "description": "In case the project assures justice and does not promote discriminations, the answer must be yes.",
      "boolean": true
    },
    "question6": {
      "text": "Have you already faced the problem of Bias in similar AI projects?",
      "description": "In case the user has faced bias in previous projects similar to the current one for several aspects, the answer must be yes. ",
      "boolean": true
    }
  },
  "section2": {
    "question1": {
      "text": "Heterogeneity of gender ",
      "description": "The variable expresses the proportion between male and female members of the team. It is the ratio between the most represented gender and the least represented one. In order to compile the information correctly the user must calculate the number of females and males and compile the cells. ",
      "boolean": false,
      "classes": [
        "Number of males",
        "Number of females"
      ]
    },
    "question2": {
      "text": "Hetereogenity of area of origin (e.g. project scope: International)",
      "description": "The variety of ethnicity/culture helps having different perspectives of the problem. In case the project aims to be valid internationally the classes should be the 5 continents, while for a more geographically restricted project might be introduced different representations of cultural variety. (ex. different regions in Italy)",
      "boolean": false,
      "classes": [
        "Europe",
        "America",
        "Asia",
        "Australia",
        "Africa"
      ]
    },
    "question3": {
      "text": "Heterogeneity of age",
      "description": "The variable expresses the variety in terms of age of the team members. This variety helps having different perspectives about the problem. ",
      "boolean": false,
      "classes": [
        "Age < 30",
        "30 <= Age < 40",
        "Age >= 40"
      ]
    },
    "question4": {
      "text": "Heterogeneity of years of experience",
      "description": "The variable expresses the variety in terms of years of experience of the team members. This aspect  mainly helps in having different working methods and points of view. The options have been ordered in three intervals.",
      "boolean": false,
      "classes": [
        "Years < 2",
        "2 <= Years < 10",
        "Years >= 10"
      ]
    },
    "question5": {
      "text": "Heterogeneity of background education",
      "description": "The variable expresses the variety of the team in terms of educational background of the members of the team. We have made the assumption that an AI developing team is composed by informatics, mathematicians and experts of the application context.",
      "boolean": false,
      "classes": [
        "Informaticians",
        "Mathematicians",
        "Context experts"
      ]
    },
    "question6": {
      "text": "Heterogeneity of study title",
      "description": "The variable expresses the variety of study titles in the team, given the assumptions that an AI developing team is composed by highly educated people. We have assumed three classes: Bachelor, Master, PhD. ",
      "boolean": false,
      "classes": [
        "Bachelor",
        "Master",
        "PhD"
      ]
    },
    "question7": {
      "text": "Is it a  cooperative team, in which everyone's opinion is considered?",
      "description": "The questions aim is to understand whether there is a method for decision making in the team where everyone is taken into account. It is crucial when it comes to bias avoiding. ",
      "boolean": true
    },
    "question8": {
      "text": "Are the team's responsibilities appropriately distributed among the members?",
      "description": "The question's aim is to understand whether the responsibilities are distributed in a fair way among the team members.",
      "boolean": true
    },
    "question9": {
      "text": "Have the team members already collaborated in the past?",
      "description": "In case part of the team members have worked together in past projects, the answer to this question must be yes.",
      "boolean": true,
      "reverse": true
    }
  },
  "section3": {
    "question1": {
      "text": "Heterogeneity of gender - Insert percentage values (e.g. 60 - 40)",
      "description": "The variable expresses the proportion between male and female members of the team. It is the ratio between the most represented gender and the least represented one. In order to compile the information correctly the user must calculate the number of females and males and compile the cells below. ",
      "boolean": false,
      "classes": [
        "Number of males",
        "Number of females"
      ]
    },
    "question2": {
      "text": "Hetereogenity of area of origin (e.g. project scope: International) - Insert percentage values",
      "description": "The variety of ethnicity/culture helps having different perspectives of the problem. In case the project aims to be valid internationally the classes should be the 5 continents, while for a more geographically restricted project might be introduced different representations of cultural variety. (ex. different regions in Italy)",
      "boolean": false,
      "classes": [
        "Europe",
        "America",
        "Asia",
        "Australia",
        "Africa"
      ]
    },
    "question3": {
      "text": "Heterogeneity of age - Insert percentage values (e.g. 30 - 50 - 20)",
      "description": "The variable expresses the variety in terms of age of the team members. This variety helps having different perspectives about the problem. ",
      "boolean": false,
      "classes": [
        "Age <= 30",
        "30 < Age < 60",
        "Age >= 60"
      ]
    },
    "question4": {
      "text": "Do the observations come from a group of people with different physical characteristics?",
      "description": "The variable expresses the variety in terms of height, weight, colour of skin, colour of hair etc. of the team members. This variety helps having different perspectives about the problem. ",
      "boolean": true
    },
    "question5": {
      "text": "Have you considered the several input categories available in your context (including minorities etc.)?",
      "description": "The question's aim is to understand whether the fact of existing minorities or other aspects have been taken into account when choosing the variables in order to avoid their discrimination. (example of input category: disabled people, dwarf people etc.).",
      "boolean": true
    },
    "question6": {
      "text": "Have you considered a significant amount of features for your dataset?",
      "description": "The question's aim is to understand whether the feature selection has done in order to acquire the most significant information about the different observations in terms of importance and quantity. (example of features: hair of color, height etc.)",
      "boolean": true
    }
  },
  "section4": {
    "question1": {
      "text": "Are the data collected up to date?",
      "description": "The question's aim is to understand whether the data collected is updated such that it is valid in the actual context, and is not based on obsolete data.",
      "boolean": true
    },
    "question2": {
      "text": "Do you have different sources of data collection?",
      "description": "The question's aim is to understand whether the sources from where the data has been collected are diverse or unique.",
      "boolean": true
    },
    "question3": {
      "text": "Are you sure about the reliability of your sources?",
      "description": "The question's aim is to understand whether the user trusts on the sources that have been used or is someway uncertain about some of them.",
      "boolean": true
    },
    "question4": {
      "text": "Have you used questionnaires that could be affected by Bias to collect data? ",
      "description": "The question's aim is to understand whether, in case of using questionaires, human bias has taken into account when collecting the different answers. Sometimes aspects as question order or the persons willingness to compile the questionnaire can affect collected data.",
      "boolean": true,
      "reverse": true
    },
    "question5": {
      "text": "Do you have a data cleaning phase in your data gathering process?",
      "description": "The question's aim is to understand whether the data have been submitted to a clean up during the data gathering phase in order to make the data as similar as possible to the reality of what it is linked to.",
      "boolean": true
    },
    "question6": {
      "text": "Do you use analytic tools to evaluate the quality of your data?",
      "description": "The question's aim is to understand whether the team uses analytic tools and metrics in order to assure the quality of the data gathered.",
      "boolean": true
    },
    "question7": {
      "text": "In case there is a need of tagging, was the dataset already tagged at collection time?",
      "description": "The question's aim is to understand whether the dataset has been submitted to tagging before collection. A tag is a non-hierarchical keyword or term assigned to a piece of information. This tag must be sometimes assigned when gathering data.  ",
      "boolean": true
    },
    "question8": {
      "text": "In case it was not, is the team responsible for tagging the observations balanced?",
      "description": "The question's aim is to understand whether the people that were responsible for tagging are somehow etherogeneus.",
      "boolean": true
    }
  },
  "section5": {
    "question1": {
      "text": "Is the Dataset size significative with respect to the population of study size? ",
      "description": "The question's aim is to understand whether the data collected are a significant sample of universal real world sample. Sometimes the importance of the real size of the samples that are taken from the context to which a model is going to be applied can be underestimated. This can lead to totally useless conclusions even using a good model.",
      "boolean": true
    },
    "question2": {
      "text": "Is the Dataset size significative with respect to its context?",
      "description": "The question's aim is to understand whether the data collected is a significant sample of universal real world sample that belongs to the specific context of application. ",
      "boolean": true
    }
  },
  "section6": {
    "question1": {
      "text": "Is the data gathering phase transparent?",
      "description": "The question's aim is to understand whether the data gathering process is traceable and interpretable, thus clear.",
      "boolean": true
    },
    "question2": {
      "text": "Is the algorithmic phase transparent?",
      "description": "The question's aim is to understand whether the algorithm training and testing process is traceable and interpretable, thus clear.",
      "boolean": true
    },
    "question3": {
      "text": "Are you sure on the weights assigned to the features?",
      "description": "The question's aim is to understand whether the weigths assigned are reliable and supported by consistent experience or data.",
      "boolean": true
    },
    "question4": {
      "text": "Are you sure that the code is not embedded with biased considerations of the scientists?",
      "description": "The question's aim is to understand whether the code has been impacted by the scientists natural prejuidices.",
      "boolean": true
    },
    "question5": {
      "text": "Is the algorithm considering just reliable/significative features?",
      "description": "The question's aim is to understand whether the algorithm is only taking into account the variables that are more significant or reliable. ",
      "boolean": true
    },
    "question6": {
      "text": "Is the output represented through an appropriate level of detail?",
      "description": "The question's aim is to understand whether the algorithm's output provides the amount of detail required for the solution of the problem or it can lead to unintentional assumptions from the team members.",
      "boolean": true
    },
    "question7": {
      "text": "Do you think your developing team will be able to interpret the output and detect any presence of bias?",
      "description": "The question's aim is to understand whether the algorithm's output provides the amount of detail required for the solution of the problem so that the developing team can detect beforehand the existence of bias in the output.",
      "boolean": true
    },
    "question8": {
      "text": "Do you think is it easy to trace the error/bias evaluating the output?",
      "description": "The question's aim is to understand whether the algorithm's output provides the amount of detail required to trace the bias or error emerged from the algorithm.",
      "boolean": true
    }
  }
} 